export const checkList = [
  {
    "key": "车内@车窗",
    "remark": "检查车窗升降是否顺畅"
  },
  {
    "key": "车内@仪表",
    "remark": "仪表各功能显示是否正常"
  },
  {
    "key": "车内@换档",
    "remark": "换档是否顺畅"
  },
  {
    "key": "车内@显示屏",
    "remark": "显示屏功能是否正常"
  },
  {
    "key": "车内@空调",
    "remark": "制冷制热是否正常"
  },
  {
    "key": "车内@倒车辅助",
    "remark": "倒车雷达与倒车影像功能是否正确"
  },
  {
    "key": "外观@车轮胎",
    "remark": "胎毛是否存在，检查轮胎是否存在异常磨损"
  },
  {
    "key": "车内@仪表显示里程",
    "remark": "里程一般不超过50KM"
  },
  {
    "key": "车内@坐椅",
    "remark": "是否存在伤痕"
  },
  {
    "key": "发动机舱@水渍/锈迹",
    "remark": "有水渍/锈迹表示可能是泡水车"
  },
  {
    "key": "发动机舱@螺丝拆卸痕迹",
    "remark": "若有拆卸痕迹说明车辆经过维修或换件"
  },
  {
    "key": "发动机舱@查看机油颜色以及粘稠度",
    "remark": "如果颜色过深或很稀，表示机油已经使用较长时间，此时要怀疑是否调过里程表"
  },
  {
    "key": "底盘(安装发动机保护板前,举升查看)",
    "remark": "是否存在剐蹭痕迹/漏油"
  },
  {
    "key": "试驾@是否有异响",
    "remark": "有异响这车得换，表示有部件松况"
  },
  {
    "key": "赠品",
    "remark": "检查该送的是不是都送了"
  },
  {
    key: '车辆检查-漆面',
    remark: '看是否有划痕、凹陷、螺旋纹等；主要检查部位为：前后保险杠（拖车时容易刮伤）；有条件的可用专业工具漆膜仪检测一下整车的漆是否一致，为原厂漆；补漆的位置一般漆面会发涩并且不光滑；建议携带一个手电筒作为小工具使用，会很有帮助。',
  },
  {
    key: '车辆检车-生产日期',
    remark: `
        车（一般6个月以上算库存车，库存车也可以购买，但最好是近期生产的车）、玻璃、轮胎、电瓶、安全带；一般而言，玻璃和轮胎的生产日期要早于汽车的生产日期，并且相对称的地方应该是一致的，如果不一致，需要谨慎对待了。
        轮胎生产日期举例：后两位数代表生产年份，前两位数字代表第几周。例如1211代表2011年第12周生产。
        玻璃生产日期举例：\n
        第一种，数字+小黑点+大黑点: 数字代表年份的最后一值，小黑点代表季度，大黑点代表该季度的第几个月。如 3... ●●● 代表2013年12月。
        第二种，数字+小黑点：数字代表年份的最后一位，如果小黑点在数字的前面，用7减去小黑点的个数即代表月份，如果小黑点在数字的后面，则用13减去小黑点的个数即代表月份。例如 3.... 代表2013年9月。
    `,
  },
  {
    key: "车辆检车-整车检查",
    remark: "开关门声音是否一致正常，接缝的胶条是否老化，接缝处的大小包括：门缝，引擎盖，后备箱灯是否正常。"
  },
  {
    key: "车辆检车-检查后备箱",
    remark: "备胎，换胎工具，三角警示牌，洗车工具是否齐全。"
  },
  {
    key: "车辆检车-车辆内部",
    remark: "行驶里程（这个仅为参考，因为店家是可以操作行驶里程的，比如把测里程的接头拔掉），但一般而言，行驶里程不要超过50KM；内饰有无破损；安全带可以全部拉出，看下是否有泡水现象，这样可以侧面反映是否为泡水车；让销售人员对着功能表把所有的功能都试一遍，看是否正常；自己试一下座椅调节，后视镜调节，远光灯，近光灯，雾灯，空调制冷、制热，天窗有无漏水现象，雨刮是否老化；可以打开蓝牙，看是否连接过其他设备，也能侧面反映出这台车是否是新车。"
  },
  {
    key: "车辆检车-车头部分",
    remark: "检查一下刹车油，防冻液，机油等是否在MIN-MAX之间，有无渗漏现象。可拉出机油尺看一下机油的颜色是否为黄色，如果为黑色，就需要注意了是否为试驾车。发动机可以让销售人员点着，切换不同的工作模式，听一下声响，虽然说外行看热闹，但听一下能避免显而易见的问题。对于汽车上各种液体的用途和分类，可以看我下一篇文章，会专门介绍。"
  },
  {
    key: "车辆检车-车底部分",
    remark: "有条件的话，让销售人员将车辆整体架空起来，检查一下车底是否有明显的划痕和螺丝拆卸的痕迹，是否有漏油，渗油的情况。一般而言，店家是不会允许买家把底盘拆掉来查看的，因此我们只能用手电筒和用手摸一下，大致看看是否有漏油的情况。"
  },
  {
    key: "车辆检车-车架号",
    remark: "需要拍一下车架号（相当于车的身份证号），主驾驶位下的VIN码、前挡风玻璃下的VIN码，保单、发票上的VIN码应该三码一致。"
  },
  {
    key: "车辆检车-电瓶",
    remark: "电瓶的健康状况：汽车电瓶上都会有指示灯，绿色代表健康，黑色代表充电中，白色代表电瓶挂了。"
  },
  {
    key: "发票检查-四联发票",
    remark: "发票联、报税联、登记注册联、抵扣联"
  },
  {
    key: "发票检查-车辆合格证",
    remark: "这个有时候店家会抵押出去，要记得查看"
  },
  {
    key: "发票检查-保险单",
    remark: ""
  },
  {
    key: "发票检查-车辆信息表",
    remark: ""
  },
  {
    key: "发票检查-车辆一致性证书",
    remark: ""
  },
  {
    key: "发票检查-使用手册",
    remark: ""
  },
  {
    key: "发票检查-购车合同",
    remark: ""
  },
  {
    key: "发票检查-三包凭证",
    remark: ""
  },
  {
    key: "发票检查-环保标志",
    remark: ""
  },
];

export const getStorage = (key: string) => {
  return JSON.parse(window?.localStorage?.getItem(key) || '[]');
};

export const setStorage = (key: string, value: any) => {
  window?.localStorage?.setItem(key, JSON.stringify(value));
};

export const removeStorage = (key: string) => {
  window?.localStorage?.removeItem(key);
};
